import React from "react";
import "./CookiePolicy.css";

const CookiePolicy = () => {
  return (
    <div className="cookie-policy-container">
      {/* ส่วนหัวของหน้า */}
      <header className="cookie-policy-header">
        <h1>นโยบายเกี่ยวกับคุกกี้</h1>
      </header>

      {/* ส่วนเนื้อหานโยบายคุกกี้ */}
      <div className="cookie-policy-content">
        <p><strong>นโยบายการใช้คุกกี้</strong> บริษัทหลักทรัพย์  จำกัด (มหาชน) ("บริษัท") มีการใช้คุกกี้เพื่อเพิ่มประสิทธิภาพและประสบการณ์ที่ดีในการเข้าชมเว็บไซต์ <a href="http://www.pi.financial">http://www.vistathai.com</a> โดยบริษัทจำเป็นต้องใช้คุกกี้เพื่อเก็บข้อมูลการใช้งาน หรือสามารถใช้เป็นข้อมูลผู้ใช้งานหากมีการประมวลผลกับข้อมูลในส่วนอื่น ๆ</p>

        <p><strong>คุกกี้คืออะไร?</strong> คุกกี้ คือข้อความขนาดเล็กที่ถูกบันทึกไว้ในเว็บเบราว์เซอร์ที่ท่านใช้งาน เมื่อท่านใช้งานเว็บไซต์ โดยคุกกี้จะถูกใช้งานเพื่อสนับสนุนการทำงานของเว็บไซต์ ปรับปรุงประสิทธิภาพการให้บริการ และการจัดการรายงาน</p>

        <p><strong>คุกกี้ที่จำเป็นอย่างยิ่ง</strong> คุกกี้มีความสำคัญในการให้ท่านสามารถเยี่ยมชมเว็บไซต์ของบริษัทได้ และในการให้บริการและฟังก์ชันต่างๆ บนเว็บไซต์ของบริษัท และการเข้าถึงพื้นที่ปลอดภัยบนเว็บไซต์ของบริษัท หากไม่มีคุกกี้นี้ เว็บไซต์ของบริษัทหรือบางฟังก์ชันบนเว็บไซต์อาจจะไม่สามารถทำงานได้ตามปกติ รวมถึงท่านอาจจะไม่สามารถใช้บริการบางอย่างบนเว็บไซต์ของบริษัทได้</p>

        <p><strong>คุกกี้ที่เก็บข้อมูลการใช้งาน</strong> คุกกี้จะเก็บรวบรวมข้อมูลการใช้งานของท่านบนเว็บไซต์ของบริษัท เช่น เว็บไซต์ที่ท่านเข้าชม เว็บไซต์ที่ท่านอยู่มากที่สุด และลิงก์ที่ท่านอาจคลิกเข้าไปเยี่ยมชม ทั้งนี้ คุกกี้จะไม่เก็บรวบรวมข้อมูลใด ๆ ที่สามารถระบุตัวตนของท่านได้ แต่อยู่ในลักษณะของข้อมูลแบบแผนและไม่สามารถระบุตัวตนได้</p>

        <p><strong>คุกกี้เพื่อกำหนดเป้าหมายหรือโฆษณา</strong> บริษัทใช้คุกกี้ประเภทนี้เพื่อช่วยให้คุณสามารถตรงกับความสนใจของท่านมากยิ่งขึ้น และแจ้งคำจัดความครั้งที่ท่านจะได้รับโฆษณาทั่วไป รวมถึงช่วยตรวจสอบประสิทธิภาพของแผนโฆษณาบนเว็บไซต์ คุกกี้ประเภทนี้จะถูกใช้งานกับช่องทางสื่อโฆษณา (เช่น Facebook, Google และอื่นๆ) โดยได้รับอนุญาตจากบริษัทบุคคลอื่น ในกรณีที่บริษัทใช้คุกกี้ประเภทนี้ในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลของท่าน บริษัทจะต้องขอความยินยอมจากท่านก่อน</p>

        <p><strong>คุกกี้จากบุคคลที่สาม</strong> ในบางกรณี เราอาจจำเป็นในการใช้คุกกี้จากบุคคลที่สามที่เชื่อถือได้ เพื่อประโยชน์ในการใช้งานของท่าน อย่างไรก็ตามโปรดทราบว่าบุคคลดังกล่าวอาจมีนโยบายการใช้คุกกี้ของตนเอง บริษัทขอแนะนำให้ท่านอ่านนโยบายการใช้คุกกี้ดังกล่าวเพิ่มเติม</p>

        <p><strong>การจัดการคุกกี้ในเว็บเบราว์เซอร์</strong> ท่านสามารถตั้งค่าเว็บเบราว์เซอร์ของท่าน และใช้คุกกี้เฉพาะคุกกี้ที่คุณยินยอมใช้ รวมทั้งอนุญาตให้คุกกี้บางตัวทำงานเท่านั้น นอกจากนี้ท่านยังสามารถลบคุกกี้ที่มีการบันทึกไว้ได้ โดยท่านสามารถตั้งค่าในเว็บเบราว์เซอร์ดัง ๆ ของท่านได้</p>
      </div>
    </div>
  );
};

export default CookiePolicy;
